//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.WriteLine ("Введите трехзначное число:");
int number = Convert.ToInt32 (Console.ReadLine());
int digit1 = number / 10 ;
int digit2 = digit1 % 10 ;
Console.WriteLine (digit2);
